Extensions/БИТ_Доработки_НДЭ/DataProcessors/УпаковкаВПаллеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УпаковкаВПаллеты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееКоличествоКоробов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателяСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СколькоПаллетовСоздать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемыйСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВместимостьПаллетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СколькоВПоследнемПаллетеВместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Паллеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШКПаллета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СколькоУпакованоКоробов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вместимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолностьюУпакован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МоноПаллет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодМонопаллета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/УпакованныеКороба.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УпакованныеКороба</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШКПаллета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШККороба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/InformationRegisters/УпаковкаПродукцииКодыМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УпаковкаПродукцииКодыМаркировки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерНабора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихкодКороба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отсканировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУпаковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаУпаковкуСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаУпаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобраноВКороб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКороб</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаКоробСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаКороб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиВДокументеОсновании</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/Enums/ТипыШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыШтрихкодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Code128</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>SSCC</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/БИТ_Доработки_НДЭ/DataProcessors/УпаковкаВПаллеты/Forms/ФормаДерева/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешеноЗакрытиеФормы = Ложь;
	Элементы.РаспечататьШтрихкодМонопаллета.Видимость = Ложь;
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		Объект.ДокументОснование = Параметры.ДокументОснование;
		Объект.ЗаказПокупателяСсылка = Объект.ДокументОснование.ЗаказПокупателя;
		Объект.Контрагент = Объект.ЗаказПокупателяСсылка.Контрагент;
		Если Объект.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("РВБ ООО") Тогда
			Объект.ИспользуемыйСклад = 2;
		ИначеЕсли Объект.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("ИНТЕРНЕТ РЕШЕНИЯ ООО") Тогда 
			Объект.ИспользуемыйСклад = 1;
		Иначе
			ВызватьИсключение("Неверный контрагент в заказе покупателя, необходимо указать РВБ ООО или ИНТЕРНЕТ РЕШЕНИЯ ООО");
		КонецЕсли;
	Иначе
		ВызватьИсключение("Нет основания документа производства или заказа покупателя!");
	КонецЕсли; 
	
	Если Параметры.Свойство("ШКПаллета") Тогда
		ШКПаллета = Параметры.ШКПаллета;
	Иначе
		ВызватьИсключение("Нет штрихкода паллета!");
	КонецЕсли;
	Если Параметры.Свойство("ШтрихкодМонопаллета") Тогда
		ШтрихкодМонопаллета = Параметры.ШтрихкодМонопаллета;
	КонецЕсли;
	
	СформироватьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Устанавливаем обработчик ожидания, который сработает через 1 секунду
	WSHShell = Новый COMОбъект("WScript.Shell");
	WSHShell.SendKeys("% ");
	WSHShell.SendKeys("{DOWN}{DOWN}{DOWN}{DOWN}{ENTER}");
	ЭтаФорма.ОбновитьОтображениеДанных();
	//Элементы.ДеревоЗначенийПаллета.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПаллетаПриАктивизацииСтроки(Элемент)
	// Получаем данные текущей строки
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено И ТекущаяСтрока = 0 И ЗначениеЗаполнено(ШтрихкодМонопаллета) Тогда//если выбрана строка и она первая(так как паллет под индексом 0
		// Получаем значение уровня из строки
		ЗначениеУровня = Элемент.ТекущиеДанные.Уровень;
		
		// Показываем кнопку, если уровень = "Паллет"
		Элементы.РаспечататьШтрихкодМонопаллета.Видимость = (ЗначениеУровня = "Паллет");
	Иначе
		Элементы.РаспечататьШтрихкодМонопаллета.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьДерево()
	
	// Очищаем дерево
	//НовоеДерево = Новый ДеревоЗначений();
	//НовоеДерево = ДанныеФормыВЗначение(ДеревоЗначенийПаллета, Тип(НовоеДерево));
	НовоеДерево = РеквизитФормыВЗначение("ДеревоЗначенийПаллета");
	//НовоеДерево.Колонки.Очистить();
	//НовоеДерево.Строки.Очистить();
	
	// Добавляем колонки
	//НоваяКолонка = НовоеДерево.Колонки.Добавить("Уровень");
	//НоваяКолонка.Заголовок = "Уровень";
	//
	//НоваяКолонка = НовоеДерево.Колонки.Добавить("ШтрихкодПаллета");
	//НоваяКолонка.Заголовок = "ШтрихкодПаллета";
	//
	//НоваяКолонка = НовоеДерево.Колонки.Добавить("ШтрихкодКороба");
	//НоваяКолонка.Заголовок = "ШтрихкодКороба";
	//
	//НоваяКолонка = НовоеДерево.Колонки.Добавить("КодМаркировки");
	//НоваяКолонка.Заголовок = "КодМаркировки";
	
	//Сообщить("Количество строк в дереве: " + НовоеДерево.Строки.Количество());
	//Заполняем первый уровень - сам паллет
	СтрокаПаллет = НовоеДерево.Строки.Добавить();
	СтрокаПаллет.Уровень = "Паллет";
	СтрокаПаллет.ШтрихкодПаллета = ШКПаллета;
	Если ЗначениеЗаполнено(ШтрихкодМонопаллета) Тогда
		СтрокаПаллет.ШтрихкодМонопаллета = ШтрихкодМонопаллета;
	КонецЕсли;
	// Заполняем данными (пример)
	ЗаполнитьДеревоДанными(СтрокаПаллет);
	//Сообщить("Количество строк в дереве: " + НовоеДерево.Строки.Количество());
	//на форму выводим дерево
	ЗначениеВРеквизитФормы(НовоеДерево, "ДеревоЗначенийПаллета");
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДанными(СтрокаПаллет)
	
	//добавляем шк коробов в строкуПаллета
	МассивШККоробов = ПолучитьУпакованныеКоробаПоПаллету(ШКПаллета);
	Если МассивШККоробов = Неопределено Тогда
		Сообщить("По паллету " + ШКПаллета + " нет упакованных коробов");
		Возврат;
	КонецЕсли;
	
	Для Каждого ШККороба Из МассивШККоробов Цикл
		СтрокаКороб = СтрокаПаллет.Строки.Добавить();
		СтрокаКороб.Уровень = "-Короб";
		СтрокаКороб.ШтрихкодКороба = ШККороба.ШККороба;
		
		//теперь нужно понять набор или дойпак, получить все по регистру
		МассивКМНаборовИлиДойпаков = ПолучитьКМНаборовИлиДойпаков(ШККороба.ШККороба);
		Если МассивКМНаборовИлиДойпаков = Неопределено Тогда
			Сообщить("По коробу " + Строка(ШККороба.ШККороба) + " нет упакованных наборов или дойпаков");
			Возврат;
		КонецЕсли;
		
		//Добавляем в СтрокуКороба дойпаки
		Если МассивКМНаборовИлиДойпаков[0].Тип = "Дойпак" Тогда
			Для Каждого КМДойпаков Из МассивКМНаборовИлиДойпаков Цикл
				СтрокаДойпак = СтрокаКороб.Строки.Добавить();
				СтрокаДойпак.Уровень = "--Дойпак";
				СтрокаДойпак.КодМаркировки = КМДойпаков.КодМаркировки;
			КонецЦикла;
		КонецЕсли;
		
		//Добавляем в СтрокуКороба Наборы и части набора
		Если МассивКМНаборовИлиДойпаков[0].Тип = "Набор" Тогда
			Для Каждого КМНаборов Из МассивКМНаборовИлиДойпаков Цикл
				Если КМНаборов.Тип = "Набор" Тогда
					СтрокаДойпак = СтрокаКороб.Строки.Добавить();
					СтрокаДойпак.Уровень = "--Набор";
					СтрокаДойпак.КодМаркировки = КМНаборов.КодМаркировки;
					//получаем номер набора и добавляем части по нему
				ИначеЕсли КМНаборов.Тип = "ЧастьНабора" Тогда
					СтрокаЧастьНабора = СтрокаДойпак.Строки.Добавить();
					СтрокаЧастьНабора.Уровень = "---ЧастьНабора";
					СтрокаЧастьНабора.КодМаркировки = КМНаборов.КодМаркировки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУпакованныеКоробаПоПаллету(ШтрихкодПаллета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпакованныеКороба.ШККороба КАК ШККороба
	|ИЗ
	|	РегистрСведений.УпакованныеКороба КАК УпакованныеКороба
	|ГДЕ
	|	УпакованныеКороба.ШКПаллета = &ШКПаллета";
	
	Запрос.УстановитьПараметр("ШКПаллета", ШтрихкодПаллета);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	Если ТаблицаЗначений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Функция ПолучитьКМНаборовИлиДойпаков(ШтрихкодКороба)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкаПродукцииКодыМаркировки.Тип КАК Тип,
	|	УпаковкаПродукцииКодыМаркировки.НомерНабора КАК НомерНабора,
	|	УпаковкаПродукцииКодыМаркировки.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	РегистрСведений.УпаковкаПродукцииКодыМаркировки КАК УпаковкаПродукцииКодыМаркировки
	|ГДЕ
	|	УпаковкаПродукцииКодыМаркировки.ШтрихкодКороба = &ШтрихкодКороба";
	
	Запрос.УстановитьПараметр("ШтрихкодКороба", ШтрихкодКороба);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗначений = Результат.Выгрузить();
	Если ТаблицаЗначений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТаблицаЗначений[0].Тип = "Дойпак" Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли;
	ТаблицаЗначений.Сортировать("НомерНабора Возр, Тип Возр");
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	Для Каждого СтрокаДерева Из ДеревоЗначенийПаллета.ПолучитьЭлементы() Цикл
		Элементы.ДеревоЗначенийПаллета.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры
///////////////////////ПЕЧАТЬ////////////////////////////////////////////////////
&НаКлиенте
Процедура Распечатать(Команда)
	ТекущиеДанные = Элементы.ДеревоЗначенийПаллета.ТекущиеДанные;
	Если ТекущиеДанные.Уровень = "Паллет" Тогда
		ШКПаллета = ТекущиеДанные.ШтрихкодПаллета;
		ПечатьКМ(ШКПаллета, "Паллет");
		
	ИначеЕсли ТекущиеДанные.Уровень = "-Короб" Тогда
		ШККороба = ТекущиеДанные.ШтрихкодКороба;
		ПечатьКМ(ШККороба, "Короб");
		
	ИначеЕсли ТекущиеДанные.Уровень = "--Набор" Тогда
		КМНабора = ТекущиеДанные.КодМаркировки;
		ПечатьКМ(КМНабора, "КИН");
		
	ИначеЕсли ТекущиеДанные.Уровень = "---ЧастьНабора" Тогда
		КМЧастиНабора = ТекущиеДанные.КодМаркировки;
		ПечатьКМ(КМЧастиНабора, "КМ");
		
	ИначеЕсли ТекущиеДанные.Уровень = "--Дойпак" Тогда
		КМДойпака = ТекущиеДанные.КодМаркировки;
		ПечатьКМ(КМДойпака, "КМ");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьШтрихкодМонопаллета(Команда)
	ТекущиеДанные = Элементы.ДеревоЗначенийПаллета.ТекущиеДанные;
	Если ТекущиеДанные.Уровень = "Паллет" Тогда
		ШтрихкодМонопаллета = ТекущиеДанные.ШтрихкодМонопаллета;
		ПечатьКМ(ШтрихкодМонопаллета, "ШтрихкодМонопаллета");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКМ(ВведенныйШтрихкод, ШаблонПечати)
	
	Если Не ЗначениеЗаполнено(ВведенныйШтрихкод) Тогда
		Сообщить("Введите штрихкод");
		Возврат;
	КонецЕсли;
	
	// Поиск упаковки по штрихкоду на сервере
	НайденнаяУпаковка = ПоискУпаковкиПоШтрихкодуНаСервере(ВведенныйШтрихкод);
	
	Если НайденнаяУпаковка = "" Тогда
		Сообщить("Упаковка со штрихкодом """ + ВведенныйШтрихкод + """ не найдена");//убрать в сообщение
		Возврат;
	КонецЕсли;
	
	// Получаем шаблон этикетки из справочника ХранилищеШаблонов
	ШаблонЭтикетки = ПолучитьШаблонЭтикеткиНаСервере(ШаблонПечати);
	
	Если ШаблонЭтикетки = "" Тогда
		Сообщить("Не найден шаблон этикетки");
		Возврат;
	КонецЕсли;
	
	// Формируем описание команды для печати
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("Идентификатор", "ЭтикеткаКодМаркировкиИСМП");
	ОписаниеКоманды.Вставить("ОбъектыПечати", Новый Массив);
	ОписаниеКоманды.ОбъектыПечати.Добавить(НайденнаяУпаковка);
	ОписаниеКоманды.Вставить("Форма", ЭтаФорма); 
	ОписаниеКоманды.Вставить("ШаблонЭтикетки", ШаблонЭтикетки);
	
	// Получаем данные для печати
	ОбъектыПечати = ПечатьЭтикетокИСМПВызовСервера.ДанныеДляПечатиШтрихкодовУпаковокИСМП(
		ОписаниеКоманды.Идентификатор,
		ОписаниеКоманды.ОбъектыПечати,
		Новый Массив()); // МассивШаблоновКодовМаркировок сразу создаем
	
	Если ОбъектыПечати.Количество() = 0 Тогда
		Сообщить(НСтр("ru='Нет данных для печати этикеток.'"));
		Возврат;
	КонецЕсли;
	
	// Формируем параметры открытия формы
	ПараметрыОткрытия = Новый Структура(
		"АдресВХранилище, Шаблоны", 
		ПоместитьВоВременноеХранилище(Новый Структура("РежимПечати, ОбъектыПечати", "Выборочно", ОбъектыПечати)),
		Новый Массив());
		
		
	ПараметрыОткрытия.Вставить("СразуНаПринтер", Истина);
	ПараметрыОткрытия.Вставить("ШаблонЭтикетки", ШаблонЭтикетки);
	
	ДанныеП = выполнитьПечатьНаСервере(ПараметрыОткрытия);
	ВыполнитьПечатьДока(ДанныеП,ВведенныйШтрихкод, ШаблонПечати);
КонецПроцедуры

&НаСервере
Функция выполнитьПечатьНаСервере(ПараметрыОткрытия)
	СразуНаПринтер        = ПараметрыОткрытия.СразуНаПринтер;
	КоличествоЭкземпляров = 1;
	ШаблонЭтикетки        = ПараметрыОткрытия.ШаблонЭтикетки;
	
	Если ЗначениеЗаполнено(ПараметрыОткрытия.АдресВХранилище) Тогда
	АдресВХранилище = ПоместитьВоВременноеХранилище(
		ПолучитьИзВременногоХранилища(ПараметрыОткрытия.АдресВХранилище),
		УникальныйИдентификатор);
	КонецЕсли;
	
	ДанныеПечати = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Для Каждого СтрокаПечати Из ДанныеПечати.ОбъектыПечати Цикл
		СтрокаПечати.ШаблонЭтикетки = ШаблонЭтикетки;
	КонецЦикла;
	
	Возврат ДанныеПечати;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПечатьДока(ДанныеП,ВведенныйШтрихкод, ШаблонПечати)
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("КоличествоЭкземпляров", 1);//не нужна структура вообще, здесь формируем по своему отдельно в вызове печати
	ПараметрыПечати.Вставить("СтруктураДанных", ДанныеП);
	ПараметрыПечати.Вставить("АдресВХранилище", "");
	ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Истина);
	ПараметрыПечати.Вставить("СразуНаПринтер", Истина);
	ПараметрыПечати.Вставить("РежимПечати", "ЭтикеткаКодМаркировкиИСМП");  
	
	
	Если КонстантаПечататьСразуНаПринтер() Тогда
		Если ШаблонПечати = "Паллет" Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ПечатьЭтикетокИЦенников", "ЭтикеткаКодМаркировкиИСМП", ПараметрКоманды, ПараметрыПечати);
			
		ИначеЕсли ШаблонПечати = "Короб" ИЛИ ШаблонПечати = "ШтрихкодМонопаллета" Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаШтрихкодыУпаковки",ПараметрКоманды, ПолучитьПараметрыДляШтрихкодовУпаковок(ВладелецФормы.УникальныйИдентификатор,ВведенныйШтрихкод,ШаблонПечати));
			
		ИначеЕсли ШаблонПечати = "КИН" ИЛИ ШаблонПечати = "КМ" Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Обработка.ПечатьЭтикетокИЦенников", "ЭтикеткаКодМаркировкиИСМП", ПараметрКоманды, ПараметрыПечати);
			
		КонецЕсли;
	Иначе
		Если ШаблонПечати = "Паллет" Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаКодМаркировкиИСМП",ПараметрКоманды,ВладелецФормы,ПараметрыПечати);
			
		ИначеЕсли ШаблонПечати = "Короб" ИЛИ ШаблонПечати = "ШтрихкодМонопаллета" Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаШтрихкодыУпаковки",ПараметрКоманды, ВладелецФормы, ПолучитьПараметрыДляШтрихкодовУпаковок(ВладелецФормы.УникальныйИдентификатор,ВведенныйШтрихкод,ШаблонПечати));
			
		ИначеЕсли ШаблонПечати = "КИН" ИЛИ ШаблонПечати = "КМ" Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьЭтикетокИЦенников","ЭтикеткаКодМаркировкиИСМП",ПараметрКоманды,ВладелецФормы,ПараметрыПечати);
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляШтрихкодовУпаковок(ИдентификаторВладельца, ШККороба, ШаблонЭтикетки)
	
	ПараметрыПечати = Новый Структура;
	ШтрихкодыУпаковок = Новый ТаблицаЗначений;
	// Добавляем колонки
	ШтрихкодыУпаковок.Колонки.Добавить("ДатаМаркировки", Новый ОписаниеТипов("Дата"));
	ШтрихкодыУпаковок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ШтрихкодыУпаковок.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	ШтрихкодыУпаковок.Колонки.Добавить("ТипШтрихкода", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
	ШтрихкодыУпаковок.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	ШтрихкодыУпаковок.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ШтрихкодыУпаковок.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));

	// Создаем строку
	СтрокаТаблицы = ШтрихкодыУпаковок.Добавить();

	// Заполняем значения (имитация данных)
	СтрокаТаблицы["ДатаМаркировки"] = '00010101'; // Пустая дата
	СтрокаТаблицы["Номенклатура"] = "";//НоменклатураТекущая;//////////////////////////////////////////////////////////////////////////////////////////////////ХЗ
	СтрокаТаблицы["Ссылка"] = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода",ШККороба);
	СтрокаТаблицы["ТипШтрихкода"] = Перечисления.ТипыШтрихкодов.Code128;
	СтрокаТаблицы["Упаковка"] = Неопределено; // Пустая ссылка
	СтрокаТаблицы["Характеристика"] = Неопределено; // Пустая ссылка
	СтрокаТаблицы["Штрихкод"] = ШККороба;
	
	ПараметрыПечати.Вставить("ИсходныеДанные", ЗначениеВСтрокуВнутр(ШтрихкодыУпаковок));
	//ПараметрыПечати.Вставить("ИсходныеДанные", ЗначениеВСтрокуВнутр(ШтрихкодыУпаковок.Выгрузить()));
	ПараметрыПечати.Вставить("ШаблонЭтикетки",ПолучитьШаблонЭтикеткиНаСервере(ШаблонЭтикетки));
	ПараметрыПечати.Вставить("КоличествоЭкземпляров", 1);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	ПараметрыПечати.Вставить("РежимПечати", "ЭтикеткаКодМаркировкиИСМП");
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаСервере
Функция КонстантаПечататьСразуНаПринтер()
	Возврат Константы.БИТ_ОтправкаПечатиКМКИНУШКсразуНаПринтер.Получить();
КонецФункции

&НаСервере
Функция ПоискУпаковкиПоШтрихкодуНаСервере(Знач ВведенныйШтрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
		|	ИЛИ ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкодаУпаковки";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", ВведенныйШтрихкод);
	Запрос.УстановитьПараметр("ЗначениеШтрихкодаУпаковки", ВведенныйШтрихкод);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции  

&НаСервере
Функция ПолучитьШаблонЭтикеткиНаСервере(ШаблонЭтикетки)
	
	// Ищем шаблон по имени или типу
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХранилищеШаблонов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХранилищеШаблонов КАК ХранилищеШаблонов
		|ГДЕ
		|	ХранилищеШаблонов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ШаблонЭтикетки);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	
	// Если не нашли, возвращаем пустую строку
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Неопределено);
КонецПроцедуры
